---
kind: property
id: P:Autodesk.Revit.UI.RibbonItemData.Name
source: html/162bf718-d706-d7f6-b16d-08f1fcd38849.htm
---
# Autodesk.Revit.UI.RibbonItemData.Name Property

The name of the item.

## Syntax (C#)
```csharp
public string Name { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when setting the value to Nothing nullptr a null reference ( Nothing in Visual Basic) .
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when setting the value to an empty string.